'''
global היא מילה שמורה בפייתון.
שיש משתנה גלובל בפונקציה ניתן לשנות את הערך שלו מתוך הפונקציה.
שמשתמשים בגלובל יש כמה חסרונות כמו קושי במעקב אחרי משתנה, מקשה על הבנה של הקוד אם יש מספר משתנים בעלי אותו השם, וזה מגביל את המשתמש
להשתמש בפונקציה מבלי לשנות את הקוד.

השגיאה בקוד נוצרת בגלל שפייתון מזהה את X כ 4, בתוך הפונקציה foo , אבל הוא לא הוגדר לפני השימוש בו בפונקציה.
פייתון מנסה לגשת ל X בהדפסה אבל זה מופנה למשתנה לא מוגדר
אם המשתמש היה כותב ומגדיר את X כגלובלי לפני ההדפסה בתוך הפונקציה לא הייתה נוצרת שגיאה
'''